; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite4 - satellite
	instrument11 - instrument
	instrument12 - instrument
	image1 - mode
	image2 - mode
	spectrograph4 - mode
	infrared3 - mode
	thermograph0 - mode
	GroundStation0 - direction
	Star2 - direction
	Star4 - direction
	Star1 - direction
	GroundStation3 - direction
	Star5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 Star4)
	(supports instrument1 image2)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet11)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 Star2)
	(supports instrument3 spectrograph4)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 image2)
	(supports instrument4 infrared3)
	(calibration_target instrument4 Star4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
	(supports instrument5 image1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star2)
	(supports instrument6 image2)
	(calibration_target instrument6 Star4)
	(supports instrument7 spectrograph4)
	(supports instrument7 infrared3)
	(calibration_target instrument7 Star2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star10)
	(supports instrument8 infrared3)
	(supports instrument8 spectrograph4)
	(supports instrument8 image2)
	(calibration_target instrument8 GroundStation3)
	(supports instrument9 spectrograph4)
	(calibration_target instrument9 Star4)
	(supports instrument10 infrared3)
	(supports instrument10 image2)
	(calibration_target instrument10 Star1)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
	(supports instrument11 spectrograph4)
	(supports instrument11 image2)
	(calibration_target instrument11 GroundStation3)
	(supports instrument12 thermograph0)
	(calibration_target instrument12 GroundStation3)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation3)
)
(:goal (and
	(pointing satellite1 Star4)
	(pointing satellite3 Phenomenon6)
	(pointing satellite4 GroundStation3)
	(have_image Star5 spectrograph4)
	(have_image Phenomenon6 infrared3)
	(have_image Planet7 image2)
	(have_image Planet8 image1)
	(have_image Star9 spectrograph4)
	(have_image Star10 spectrograph4)
	(have_image Planet11 thermograph0)
))

)

; plan
1. (turn_to satellite3 groundstation3 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 groundstation3)
   goals met: 1 of 10
2. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 1 of 10
3. (calibrate satellite3 instrument8 groundstation3)
   added: (calibrated instrument8)
   goals met: 1 of 10
4. (turn_to satellite3 star5 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 star5)
   goals met: 1 of 10
5. (take_image satellite3 star5 instrument8 spectrograph4)
   added: (have_image star5 spectrograph4)
   goals met: 2 of 10
6. (turn_to satellite3 star10 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 star10)
   goals met: 2 of 10
7. (take_image satellite3 star10 instrument8 spectrograph4)
   added: (have_image star10 spectrograph4)
   goals met: 3 of 10
8. (turn_to satellite3 planet7 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 planet7)
   goals met: 3 of 10
9. (turn_to satellite2 star2 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star2)
   goals met: 3 of 10
10. (take_image satellite3 planet7 instrument8 image2)
   added: (have_image planet7 image2)
   goals met: 4 of 10
11. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 4 of 10
12. (calibrate satellite2 instrument5 star2)
   added: (calibrated instrument5)
   goals met: 4 of 10
13. (turn_to satellite1 star4 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star4)
   goals met: 5 of 10
14. (turn_to satellite2 planet11 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 planet11)
   goals met: 5 of 10
15. (take_image satellite2 planet11 instrument5 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 6 of 10
16. (turn_to satellite2 planet8 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet8)
   goals met: 6 of 10
17. (take_image satellite2 planet8 instrument5 image1)
   added: (have_image planet8 image1)
   goals met: 7 of 10
18. (turn_to satellite3 star9 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 star9)
   goals met: 7 of 10
19. (take_image satellite3 star9 instrument8 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 8 of 10
20. (turn_to satellite3 phenomenon6 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 phenomenon6)
   goals met: 9 of 10
21. (take_image satellite3 phenomenon6 instrument8 infrared3)
   added: (have_image phenomenon6 infrared3)
   goals met: 10 of 10
